content/posts/Bayesian_brain_hypothesis.md
+++
title = "Bayesian brain hypothesis"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:43:36-04:00
slug = "Bayesian_brain_hypothesis"
draft = false
+++

## [probabilistic inference]({{< relref "probabilistic_inference" >}}), [philosophy]({{< relref "philosophy" >}}), [free energy principle]({{< relref "free_energy_principle" >}}), [Andy Clark]({{< relref "Andy_Clark" >}}), [Karl Friston]({{< relref "Karl_Friston" >}}) {#probabilistic-inference--probabilistic-inference-dot-md--philosophy--philosophy-dot-md--free-energy-principle--free-energy-principle-dot-md--andy-clark--andy-clark-dot-md--karl-friston--karl-friston-dot-md}


## \_\_Bayesian approaches to brain function investigate the capacity of the nervous system to operate in situations of uncertainty in a fashion that is close to the optimal prescribed by Bayesian statistics.\_\_ — via [Bayesian approaches to brain function \* Wikipedia](<https://en.wikipedia.org/wiki/Bayesian%5Fapproaches%5Fto%5Fbrain%5Ffunction>) {#bayesian-approaches-to-brain-function-investigate-the-capacity-of-the-nervous-system-to-operate-in-situations-of-uncertainty-in-a-fashion-that-is-close-to-the-optimal-prescribed-by-bayesian-statistics-dot-via-bayesian-approaches-to-brain-function-wikipedia--https-en-dot-wikipedia-dot-org-wiki-bayesian-approaches-to-brain-function}


## [The Helmholtz Machine by Peter Dayan, Geoffrey Hinton, Radford Neal, and Richard Zemel in 1995]({{< relref "The_Helmholtz_Machine_by_Peter_Dayan,_Geoffrey_Hinton,_Radford_Neal,_and_Richard_Zemel_in_1995" >}}), [probabilistic inference]({{< relref "probabilistic_inference" >}}), [variational inference]({{< relref "variational_inference" >}}) {#the-helmholtz-machine-by-peter-dayan-geoffrey-hinton-radford-neal-and-richard-zemel-in-1995--the-helmholtz-machine-by-peter-dayan-geoffrey-hinton-radford-neal-and-richard-zemel-in-1995-dot-md--probabilistic-inference--probabilistic-inference-dot-md--variational-inference--variational-inference-dot-md}


## [Whatever next? Predictive brains, situated agents, and the future of cognitive science by Andy Clark in 2013]({{< relref "Whatever_next_Predictive_brains,_situated_agents,_and_the_future_of_cognitive_science_by_Andy_Clark_in_2013" >}}) , [philosophy]({{< relref "philosophy" >}}) {#whatever-next-predictive-brains-situated-agents-and-the-future-of-cognitive-science-by-andy-clark-in-2013--whatever-next-predictive-brains-situated-agents-and-the-future-of-cognitive-science-by-andy-clark-in-2013-dot-md--philosophy--philosophy-dot-md}


## [The Bayesian brain the role of uncertainty in neural coding and computation by David C.Knill and Alexandre Pouget in 2004]({{< relref "The_Bayesian_brain_the_role_of_uncertainty_in_neural_coding_and_computation_by_David_C_Knill_and_Alexandre_Pouget_in_2004" >}}) {#the-bayesian-brain-the-role-of-uncertainty-in-neural-coding-and-computation-by-david-c-dot-knill-and-alexandre-pouget-in-2004--the-bayesian-brain-the-role-of-uncertainty-in-neural-coding-and-computation-by-david-c-knill-and-alexandre-pouget-in-2004-dot-md}


## [The Self-Evidencing Brain by Jakob Hohwy in 2016]({{< relref "The_Self-Evidencing_Brain_by_Jakob_Hohwy_in_2016" >}}) {#the-self-evidencing-brain-by-jakob-hohwy-in-2016--the-self-evidencing-brain-by-jakob-hohwy-in-2016-dot-md}


## [Computational resource demands of a predictive Bayesian brain by Johan Kwisthout and Iris van Rooij in 2020]({{< relref "Computational_resource_demands_of_a_predictive_Bayesian_brain_by_Johan_Kwisthout_and_Iris_van_Rooij_in_2020" >}}) {#computational-resource-demands-of-a-predictive-bayesian-brain-by-johan-kwisthout-and-iris-van-rooij-in-2020--computational-resource-demands-of-a-predictive-bayesian-brain-by-johan-kwisthout-and-iris-van-rooij-in-2020-dot-md}
